// Задача 2: Напишите программу, которая на вход принимает 2 числа и выдает, какое число большее, а какое меньшее

// Console.Write("Введите первое число: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if(num1 > num2)
// {
//     Console.WriteLine("max = " + num1);
// }
// else
// {
//     Console.WriteLine("max = " + num2);
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел

// Console.Write("Введите первое число: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int num3 = Convert.ToInt32(Console.ReadLine());
// int max = num1;
// if(num1 > max) max = num1;
// if(num2 > max) max = num2;
// if(num3 > max) max = num3;

// Console.Write("max = " + max);


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли оно четным (делится ли оно на два без остатка)

// Console.Write("Введите ваше число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// if(num % 2 == 0)
// {
//     Console.WriteLine("Да");
// }
// else
// {
//     Console.WriteLine("Нет");
// }

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все четные числа от 1 до N

// Console.Write("Введите ваше число: ");
// int N = Convert.ToInt32(Console.ReadLine());
// int count = 1;
// while (count <= N)
// {
//     if (count % 2 == 0) Console.WriteLine(count);
//     count++;
// }