//Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// double WhileMulti (double numA, double numB)
// {
    
//     double result = Math.Pow(numA, numB);
//     return result;
// }
// Console.Write("Введите первое число: ");
// double a = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите второе число: ");
// double b = Convert.ToDouble(Console.ReadLine());
// double multi = WhileMulti(a,b);
// Console.WriteLine($"При возведении числа {a} в число {b} получается {multi}");

// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// int SumNumber (int num)
// {
//     int result = 0;
//     int sum = 0;
//     while (num > 0)
//     {
//         sum = num % 10;
//         num /=10;
//         result += sum;
//     }
//     return result;
// }
// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int n = SumNumber(a);
// Console.WriteLine($"Сумма цифр в числе {a}: {n}");


// Напишите программу, которая задаёт массив из m элементов и выводит их на экран.

// int[] array (int size)
// {
//     int[] array = new int[size];
//     {
        
//     }
// }