// Задача: Приветствие пользователя

// Алгоритм:
// ● Начало
// ● Ввести <имя пользователя>
// ● Вывести “Привет, ”
// ● Вывести <имя пользователя>
// ● Конец


// Console.Write("Введите ваше имя ");
// string username = Console.ReadLine();
// Console.Write("Привет, ");
// Console.Write(username);