// Задача: Как поприветствовать пользователя любимчика?

// Начало
// ● Ввести имя пользователя
// ● ЕСЛИ имя пользователя совпадает с “Маша” то… 
// поприветствовать по особенному
// ● ИНАЧЕ поприветствовать по обычному
// ● Конец


// Console.Write("Введите имя пользователя: ");
// string username = Console.ReadLine();

// if(username.ToLower() == "даша")
// {
//     Console.WriteLine("Ура, это же ДАША!");
// }
// else
// {
//     Console.Write("Привет, ");
//     Console.WriteLine(username);
// }
